// Объявите 2 переменные, aи b, и присвойте переменной 20 значение aи переменной 4 значениеb
//Объявите переменную add, которая использует +оператор для хранения результата сложения значений, хранящихся в aи .b
//Объявите переменную minus, которая использует -оператор для хранения результата вычитания значений, хранящихся в aи .b
//Объявите переменную multiply, которая использует *оператор для хранения результата умножения значений, хранящихся в aи .b
//Объявите переменную dividing, которая использует /оператор для хранения результата деления значений, хранящихся в aпеременной.b
let a:number = 20;
let b:number = 4;
let minus: number = a-b;
let multiply: number = a*b;
let dividing: number = a/b;
console.log (a,b,minus,multiply,dividing);