// Три компонента внутри круглых скобок разделяются **точкой с запятой**:

// 1. **Инициализация** — создание счётчика. Выполняется **один раз**, в самом начале.
//2. **Условие** — проверяется перед каждым проходом. Должно давать `true` или `false`. Пока `true` — цикл работает.
// 3. **Шаг** — изменение счётчика. Выполняется **после** каждого прохода тела.


// ```ts
//for (инициализация; условие; шаг) {
    // тело цикла
//}
for (let i: number = 0; i < 5; i++) {
    console.log ("Hello", i);
}
for (let z:number = 0; z < 4; z++) {
    console.log (z);

}

for (let y: number = 0; y < 2; y++){
    console.log ("*");

}

//ошибочное условие в цикле
for (let y: number = 0; y < 0; y++) {
    console.log ("*");

}

//длина строки без lenght
const str: string = "Hello World";
let count: number = 0;

for (let c:number  = 0; c < str.length; c++) {
    count = count+1;

    }
console.log (count);


// Подсчёт вхождений символа:**
// Здесь всплыл хороший вопрос с лекции: почему к строке применяется `str[i]`, ведь это синтаксис массива? 
// Ответ: строка и массив в JavaScript устроены похоже — у обоих есть `length` и обращение по индексу.
//  Объявлять строку массивом не нужно, `str[i]` работает и так.

const str1: string = "Hello World";

let count1: number = 0;

for (let c1: number = 0; c1 < str1.length; c1++) {
    if (str1[c1] === "l") 
    {count1++

    }
}
console.log(count1)


    